'''
В текстовому файлі lab1.txt знаходиться математичний вираз без дужок (правильний).
Визначити:
1.       Знайти кількість дій, що в ньому виконується.
2.       Обчислити значення даного математичного виразу.
'''

# відкриваємо вхідний текстовий файл для зчитування виразів
in_f = open('Lab1.txt', 'r', encoding='utf-8')

# відкриваємо текстовий файл для запису відповідей про валідність виразу в рядку
out_f = open('Rez_4_2_1.txt', 'w', encoding='utf-8')

# змінна для зберігання номеру рядка вхідного файлу для запису в вихідний файл
kkk = 0

# перебираємо порядково вхідний файл
for line in in_f:
    kkk = kkk + 1

    k_d = 0  # Кількість дій
    nn = 0
    for simvo in line:

        if (simvo in ['+', '-', '*', '/']) and (nn != 0):
            k_d = k_d + 1
        nn = nn + 1
    out_f.write('В рядку № ' + str(kkk) + '   1) кількість дій ' + str(k_d) + '   2) Значення виразу  ' + line.strip() + ' = ' + str(eval(line)) + '\n')

in_f.close()
out_f.close()
