'''
В текстовому файлі Equation1.txt знаходиться математичний вираз з дужками. 
Встановити чи вірно розставлені дужки у заданому виразі.
'''

# відкриваємо вхідний текстовий файл для зчитування виразів
in_f = open('Eauation1.txt', 'r', encoding='utf-8')

# відкриваємо текстовий файл для запису відповідей про валідність виразу в рядку
out_f = open('Rez_4_1.txt', 'w', encoding='utf-8')

# змінна для зберігання номеру рядка вхідного файлу для запису в вихідний файл
kkk = 0

# змінна індикатор валідності рядка якщо 0 то ВАЛІДНИЙ інше НЕВАЛІДНИЙ
ggg = 0

# перебираємо порядково вхідний рядок
for line in in_f:
    ggg = 0
    kkk = kkk + 1
    v_d = 0   # Кількість відкритих дужок
    z_d = 0   # Кількість закритих дужок
    for simvo in line:
        if simvo == '(':
            v_d = v_d + 1
        if simvo == ')':
            z_d = z_d + 1
        if v_d < z_d:
            ggg = 1
            out_f.write('В рядку № ' + str(kkk) + ' НЕПРАВИЛЬНО РОЗСТАВЛЕНІ ДУЖКИ!!!' + '\n')
            break
    if ggg == 0:
        v_d = 0
        z_d = 0
        for simvo in line[::-1]:
            if simvo == '(':
                v_d = v_d + 1
            if simvo == ')':
                z_d = z_d + 1
            if v_d > z_d:
                ggg = 1
                out_f.write('В рядку № ' + str(kkk) + ' НЕПРАВИЛЬНО РОЗСТАВЛЕНІ ДУЖКИ!!!' + '\n')
                break
    if ggg == 0:
        out_f.write('В рядку № ' + str(kkk) + ' ПРАВИЛЬНО РОЗСТАВЛЕНІ ДУЖКИ!!!' + '\n')

in_f.close()
out_f.close()
